#### We are using below table as sample table as per given doc. the file name is hospital_data.txt with "|" as delimiter

In [9]:
import pandas as pd
df = pd.read_csv("hospital_data.txt",delimiter="|")
df

,Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active
0,Alex,123457,20101012,20121013,MVD,Paul,SA,USA,6031987,A
1,John,123458,20101012,20121013,MVD,Paul,TN,IND,6031987,A
2,Mathew,123459,20101012,20121013,MVD,Paul,WAS,PHIL,6031987,A
3,Matt,12345,20101012,20121013,MVD,Paul,BOS,NYC,6031987,A
4,Jacob,1256,20101012,20121013,MVD,Paul,VIC,AU,6031987,A

#### Below code will read the hospital_data.txt file and generate output file based on country column with there respective data.

In [53]:
import pandas as pd

df = pd.read_csv("hospital_data.txt",delimiter="|")
#If wanted to read data from sql tables
# df = pd.read_sql_table('hospital_data', con=engine)  

# below loop will generate result_df based on Country column
# and prepare .txt file based on different countries 
for cname in df["Country"]:
    result_df = df[df["Country"] == cname]
    result_df.to_csv("Table_{}.txt".format(cname), sep="|", index=False)
    
# If wanted to write data to sql table.
#     result_df.to_sql(con=engine, name="Table_{}".format(cname),if_exists='append',index=False)